---
kind: method
id: M:Autodesk.Revit.DB.PointOnEdgeEdgeIntersection.GetEdgeReference2
source: html/dce967d9-99ea-8bf3-14a2-a62a4910e76f.htm
---
# Autodesk.Revit.DB.PointOnEdgeEdgeIntersection.GetEdgeReference2 Method

Get a copy of the second edge or curve reference.

## Syntax (C#)
```csharp
public Reference GetEdgeReference2()
```